// JavaScript – динамично развивающийся язык программирования. Регулярно появляются предложения о добавлении в JS новых возможностей, они анализируются, и, если предложения одобряются, то описания новых возможностей языка переносятся в черновик https://tc39.github.io/ecma262/, а затем публикуются в спецификации.


// babel
    
    // Babel – это транспилер. Он переписывает современный JavaScript-код в предыдущий стандарт.


    // Термин «полифил» означает, что скрипт «заполняет» пробелы и добавляет современные функции.

    // Два интересных хранилища полифилов:
    
    // core js поддерживает много функций, можно подключать только нужные.
    // polyfill.io – сервис, который автоматически создаёт скрипт с полифилом в зависимости от необходимых функций и браузера пользователя.
    